{ "translations": {
    "Login with %1s" : "Přihlásit pomocí %1s",
    "Error" : "Error",
    "Access forbidden" : "Přístup zakázán",
    "ID4Me is disabled" : "ID4Me je vypnuté",
    "Invalid OpenID domain" : "Neplatná doména OpenID",
    "Invalid authority issuer" : "Neplatný vydavatel autority",
    "Multiple authority found" : "Nalezeno vícero autorit",
    "The received state does not match the expected value." : "Obdržený stav neodpovídá očekávané hodnotě.",
    "Authority not found" : "Autorita nenalezena",
    "Failed to decrypt the ID4ME provider client secret" : "Nepodařilo se rozšifrovat tajemství klienta poskytovatele ID4ME",
    "The received token is expired." : "Obdržený token má skončenou platnost.",
    "The audience does not match ours" : "Publikum neodpovídá našemu",
    "The authorized party does not match ours" : "Pověřená strana neodpovídá naší",
    "No authorized party" : "Žádná pověřená strana",
    "The nonce does not match" : "Nonce neodpovídá",
    "You must access Nextcloud with HTTPS to use OpenID Connect." : "Aby bylo možné použít OpenID Connect, je třeba k Nextcloud přistupovat prostřednictvím HTTPS.",
    "There is no such OpenID Connect provider." : "Neexistuje takový poskytovatel OpenID Connect.",
    "Could not reach the OpenID Connect provider." : "Nepodařilo se dosáhnout poskytovatele OpenID Connect.",
    "The identity provider failed to authenticate the user." : "Poskytovateli identity se nezdařilo ověřit uživatele.",
    "Failed to decrypt the OIDC provider client secret" : "Nepodařilo se rozšifrovat tajemství klienta poskytovatele OIDC",
    "Failed to contact the OIDC provider token endpoint" : "Nepodařilo se kontaktovat koncový bod tokenu poskytovatele OIDC",
    "The issuer does not match the one from the discovery endpoint" : "Vydavatel se neshoduje s tím z koncového bodu objevování",
    "Failed to provision the user" : "Nepodařilo se zprovoznit uživatele",
    "You do not have permission to log in to this instance. If you think this is an error, please contact an administrator." : "Nemáte oprávnění se přihlásit k této instanci. Pokud se domníváte, že se jedná o chybu, obraťte se na správce.",
    "User conflict" : "Kolize uživatelů",
    "OpenID Connect" : "OpenID Connect",
    "OpenID Connect user backend" : "Podpůrná vrstva uživatelských účtů pro OpenID Connect",
    "Use an OpenID Connect backend to login to your Nextcloud" : "Použít podpůrnou vrstvu OpenID Connect pro přihlášení se k vámi využívanému Nextcloud",
    "Allows flexible configuration of an OIDC server as Nextcloud login user backend." : "Umožňuje flexibilní nastavení OIDC serveru coby podpůrné vrstvy uživatelských účtů pro přihlašování do Nextcloud.",
    "Are you sure you want to delete the provider \"{providerName}\"?" : "Opravdu chcete smazat poskytovatele „{providerName}“?",
    "Could not save ID4me state: {msg}" : "Nepodařilo se uložit stav ID4Me: {msg}",
    "Could not save storeLoginToken state: {msg}" : "Nebylo možné uložit stav storeLoginToken: {msg}",
    "Could not update the provider:" : "Nebylo možné zaktualizovat poskytovatele:",
    "Could not remove provider: {msg}" : "Nebylo možné odebrat poskytovatele: {msg}",
    "Could not register provider:" : "Nebylo možné zaregistrovat poskytovatele:",
    "Allows users to authenticate via OpenID Connect providers." : "Umožnit uživatelům ověřovat se prostřednictvím poskytovatelů OpenID Connect.",
    "Enable ID4me" : "Zapnout ID4me",
    "Store login tokens" : "Ukládat přihlašovací tokeny",
    "\"Store login tokens\" is needed if you are using other apps that want to use user_oidc's token exchange or simply get the login token" : "„Ukládat přihlašovací tokeny“ je zapotřebí pokud používáte jiné aplikace, které chcete, aby používali výměnu user_oidc nebo zkrátka obdržely přihlašovací token",
    "Registered Providers" : "Zaregistrovaní poskytovatelé",
    "Register new provider" : "Zaregistrovat nového poskytovatele",
    "Register a new provider" : "Zaregistrovat nového poskytovatele",
    "Configure your provider to redirect back to {url}" : "Nastavte svého poskytovatele na přesměrovávání zpět na {url}",
    "No providers registered." : "Nezaregistrováni žádní poskytovatelé.",
    "Client ID" : "Identif. klienta",
    "Discovery endpoint" : "Koncový bod objevování",
    "Backchannel Logout URL" : "URL odhlášení zadního kanálu",
    "Redirect URI (to be authorized in the provider client configuration)" : "URI přesměrování (pro pověření v nastavení klienta pro poskytovatele)",
    "Update" : "Aktualizovat",
    "Remove" : "Odebrat",
    "Update provider settings" : "Zaktualizovat nastavení poskytovatele",
    "Update provider" : "Aktualizovat poskytovatele",
    "Confirm deletion" : "Potvrdit smazání",
    "Cancel" : "Storno",
    "Delete" : "Smazat",
    "Submit" : "Odeslat",
    "Client configuration" : "Nastavení klienta",
    "Identifier (max 128 characters)" : "Identifikátor (nejvýše 128 znaků)",
    "Display name to identify the provider" : "Zobrazovaný název pro identifikaci poskytovatele",
    "Client secret" : "Tajemství klienta",
    "Leave empty to keep existing" : "Pokud chcete použít existující, nevyplňujte",
    "Warning, if the protocol of the URLs in the discovery content is HTTP, the ID token will be delivered through an insecure connection." : "Varování – pokud protokol URL adres v objevování obsahuje HTTP, identifikátor tokenu bude doručen prostřednictvím nezabezpečeného spojení.",
    "Custom end session endpoint" : "Uživatelsky určený koncový bod ukončení relace",
    "Post logout URI" : "Odeslat URI pro odhlášení",
    "Scope" : "Rozsah",
    "Extra claims" : "Další tvrzení",
    "Attribute mapping" : "Mapování atributů",
    "Enable nested and fallback claim mappings (like \"{example}\")" : "Zapnout vnořené a náhradní tvrzení mapování (jako „{example}“)",
    "User ID mapping" : "Mapování identif. uživatele",
    "Quota mapping" : "Mapování kvóty",
    "Groups mapping" : "Mapování skupin",
    "Extra attributes mapping" : "Mapování dalších atributů",
    "Display name mapping" : "Mapování zobrazovaného jména",
    "Birth date mapping" : "Mapování data narození",
    "Pronouns mapping" : "Mapování zájmen",
    "Gender mapping" : "Mapování pohlaví",
    "Email mapping" : "Mapování e-mailu",
    "Phone mapping" : "Mapování telefonu",
    "Language mapping" : "Mapování jazyka",
    "Locale mapping" : "Mapování místních a jazykových nastavení",
    "Role/Title mapping" : "Mapování role/oslovení",
    "Street mapping" : "Mapování ulice",
    "Postal code mapping" : "Mapování PSČ",
    "Locality mapping" : "Mapování lokality",
    "Region mapping" : "Mapování oblasti",
    "Country mapping" : "Mapování země",
    "Organisation mapping" : "Mapování organizace",
    "Website mapping" : "Mapování webu",
    "Avatar mapping" : "Mapování zástupného obrázku",
    "Biography mapping" : "Mapování životopisu",
    "X (formerly Twitter) mapping" : "Mapování na X (dříve Twitter)",
    "Fediverse/Nickname mapping" : "Mapování fediverse/přezdívky",
    "Headline mapping" : "Mapování nadpisu",
    "Authentication and Access Control Settings" : "Nastavení ověřování a řízení přístupu",
    "Use unique user ID" : "Použít neopakující se identif. uživatele",
    "By default every user will get a unique user ID that is a hashed value of the provider and user ID. This can be turned off but uniqueness of users accross multiple user backends and providers is no longer preserved then." : "Ve výchozím stavu obdrží každý uživatel neopakující se identifikátor uživatele, který je otiskem hodnoty identifikátorů poskytovatele a uživatele. Toto je možné vypnout ale neopakovanost napříč vícero podpůrnými vrstvami pro uživatelské účty a poskytovateli nadále nebude zachována.",
    "Use provider identifier as prefix for IDs" : "Použít identifikátor poskytovatele jako předponu pro identifikátory",
    "To keep IDs in plain text, but also preserve uniqueness of them across multiple providers, a prefix with the providers name is added." : "Pro ponechání identifikátorů v čitelném textu, ale zároveň zachování toho, že se neopakují napříč vícero poskytovateli, je přidána přípona sestávající se z názvu poskytovatele.",
    "Use group provisioning." : "Použít zprovozňování skupin.",
    "Group whitelist regex" : "Regulární výraz seznamu povolených skupin",
    "Restrict login for users that are not in any whitelisted group" : "Omezit přihlašování pro uživatele, kteří nejsou v žádné skupině na seznamu povolených",
    "Users that are not part of any whitelisted group are not created and can not login" : "Uživatelé, kteří nejsou součástí žádné ze skupin na seznamu povolených nejsou vytvářeni a nemohou se přihlásit",
    "Check Bearer token on API and WebDAV requests" : "Zkontrolovat Bearer token na API a WebDAV požadavky",
    "Do you want to allow API calls and WebDAV requests that are authenticated with an OIDC ID token or access token?" : "Chcete umožnit volání API a WebDAV požadavky, které jsou ověřené pomocí tokenu identifikátoru OIDC nebo přístupového tokenu?",
    "Auto provision user when accessing API and WebDAV with Bearer token" : "Automaticky zprovoznit uživatele při přístupu k API a WebDAV pomocí Bearer tokenu",
    "This automatically provisions the user, when sending API and WebDAV requests with a Bearer token. Auto provisioning and Bearer token check have to be activated for this to work." : "Toto automaticky zprovozní uživatele, při odeslání požadavků na API a WebDAV s Bearer tokenem. Aby toto fungovalo, je třeba aktivovat automatické zprovozňování a kontrolu Bearer tokenu.",
    "Send ID token hint on logout" : "Při odhlášení odeslat nápovědu k identifikátoru tokenu",
    "Should the ID token be included as the id_token_hint GET parameter in the OpenID logout URL? Users are redirected to this URL after logging out of Nextcloud. Enabling this setting exposes the OIDC ID token to the user agent, which may not be necessary depending on the OIDC provider." : "Měl by být token identifikátoru obsažen jako GET parametr id_token_hint v URL odhlašování OpenID? Uživatelé jsou přesměrováváni na tuto URL po odhlášení se z Nextcloud. Zapnutí této volby vystav OIDC token identifikátoru uživatelskému agentovi, což nemusí být nezbytné – v závislosti na poskytovateli OIDC.",
    "Only groups matching the whitelist regex will be created, updated and deleted by the group claim. For example: {regex} allows all groups which ID starts with {substr}" : "Pouze skupiny, které odpovídají regulárnímu výrazu pro seznam povolených budou vytvářeny, aktualizovány a mazány podle tvrzení skupiny. Například: {regex} umožní všechny skupiny, kterých identifikátory začínají na {substr}",
    "This will create and update the users groups depending on the groups claim in the ID token. The Format of the groups claim value should be {sample1}, {sample2} or {sample3}" : "Toto vytvoří a zaktualizuje skupiny uživatele v závislosti na tvrzení skupin v tokenu identifikátoru. Formát hodnoty tvrzení skupin by měl být {sample1} nebo {sample2} nebo {sample3}",
    "Back to %s" : "Zpět na %s",
    "Domain" : "Doména",
    "your.domain" : "vase.domena"
},"pluralForm" :"nplurals=4; plural=(n == 1 && n % 1 == 0) ? 0 : (n >= 2 && n <= 4 && n % 1 == 0) ? 1: (n % 1 != 0 ) ? 2 : 3;"
}