{ "translations": {
    "Login with %1s" : "Log på med %1s",
    "Error" : "Fejl",
    "Access forbidden" : "Adgang forbudt",
    "ID4Me is disabled" : "ID4Me er deaktiveret",
    "Invalid OpenID domain" : "Ugyldigt OpenID domæne",
    "Invalid authority issuer" : "Ugyldig autoritetsudsteder",
    "Multiple authority found" : "Multiple autoriteter fundet",
    "The received state does not match the expected value." : "Den modtagne tilstand matcher ikke den forventede værdi.",
    "Authority not found" : "Autoritet ikke fundet",
    "Failed to decrypt the ID4ME provider client secret" : "Kunne ikke dekryptere ID4ME leverandør klient hemmeligheden",
    "The received token is expired." : "Det modtagne token er udløbet.",
    "The audience does not match ours" : "Publikum matcher ikke vores",
    "The authorized party does not match ours" : "Den godkendte part matcher ikke vores",
    "No authorized party" : "Ingen autoriseret part",
    "The nonce does not match" : "Nonce matcher ikke",
    "You must access Nextcloud with HTTPS to use OpenID Connect." : "Du skal tilgå Nextcloud via HTTPS for at anvende OpenID Connect.",
    "There is no such OpenID Connect provider." : "Der er ingen sådan OpenID Connect udbyder.",
    "Could not reach the OpenID Connect provider." : "Kunne ikke kontakte OpenID Connect leverandøren",
    "Failed to decrypt the OIDC provider client secret" : "Kunne ikke dekryptere OIDC leverandør klient hemmeligheden",
    "Failed to contact the OIDC provider token endpoint" : "Kunne ikke kontakte OIDC leverandør token slutpunktet",
    "The issuer does not match the one from the discovery endpoint" : "Udstederen matcher ikke den fra opdagelses slutpunktet",
    "Failed to provision the user" : "Kunne ikke provisionere brugeren",
    "You do not have permission to log in to this instance. If you think this is an error, please contact an administrator." : "Du har ikke tilladelse til at logge på denne instans. Hvis du mener at det er en fejl, så kontakt venligst en administrator.",
    "User conflict" : "Brugerkonfliktconflict",
    "OpenID Connect" : "OpenID Connect",
    "OpenID Connect user backend" : "OpenID Connect bruger backend",
    "Use an OpenID Connect backend to login to your Nextcloud" : "Anvend en OpenID Connect backend for at logge på din Nextcloud",
    "Allows flexible configuration of an OIDC server as Nextcloud login user backend." : "Giver mulighed for fleksibel konfiguration af en OIDC server som Nextcloud log på bruger backend.",
    "Could not save ID4me state: {msg}" : "Kunne ikke gemme ID4me tilstand: {msg}",
    "Could not save storeLoginToken state: {msg}" : "Kunne ikke gemme storeLoginToken tilstand: {msg}",
    "Could not update the provider:" : "Kunne ikke opdatere udbyderen:",
    "Could not remove provider: {msg}" : "Kunne ikke fjerne udbyder: {msg}",
    "Could not register provider:" : "Kunne ikke registrere udbyder:",
    "Allows users to authenticate via OpenID Connect providers." : "Giver brugerne mulighed for at autentificere via OpenID Connect udbydere.",
    "Enable ID4me" : "Aktivér ID4me",
    "Store login tokens" : "Gem login nøgler",
    "Registered Providers" : "Registrerede Udbydere",
    "Register new provider" : "Registrér ny udbyder",
    "Register a new provider" : "Registrér en ny udbyder",
    "Configure your provider to redirect back to {url}" : "Indstil din udbyder til at omdirigere tilbage til {url}",
    "No providers registered." : "Ingen udbydere registeret.",
    "Client ID" : "Klient ID",
    "Discovery endpoint" : "Discovery endpoint",
    "Backchannel Logout URL" : "Backchannel log af URL",
    "Redirect URI (to be authorized in the provider client configuration)" : "Omdirigér URI (for godkendelse i udbyderens klient konfiguration)",
    "Update" : "Opdatér",
    "Remove" : "Fjern",
    "Update provider settings" : "Opdatér udbyderindstillinger",
    "Update provider" : "Opdatér udbyder",
    "Confirm deletion" : "Bekræft sletning",
    "Cancel" : "Annuller",
    "Delete" : "Slet",
    "Submit" : "Send",
    "Client configuration" : "Klient konfiguration",
    "Identifier (max 128 characters)" : "Identifikator (højst 128 tegn)",
    "Display name to identify the provider" : "Vis navn for at identificere udbyderen",
    "Client secret" : "Klienthemmelighed",
    "Leave empty to keep existing" : "Lad være tom for at beholde eksisterende",
    "Warning, if the protocol of the URLs in the discovery content is HTTP, the ID token will be delivered through an insecure connection." : "Advarsel, hvis protokollen for URL'er i opdagelsesindholdet er HTTP, så vil ID token blive leveret gennem en usikker forbindelse.",
    "Custom end session endpoint" : "Brugerdefineret slut session endepunkt",
    "Scope" : "Anvendelsesområde",
    "Extra claims" : "Ekstra claims",
    "Attribute mapping" : "Attribut tilknytning",
    "Enable nested and fallback claim mappings (like \"{example}\")" : "Aktiver indlejrede og tilbagefalds claims tilknytninger (som \"{example}\")",
    "User ID mapping" : "Bruger ID tilknytning",
    "Quota mapping" : "Kvotetilknytning",
    "Groups mapping" : "Gruppe tilknytning",
    "Extra attributes mapping" : "Ekstra attributter tilknytning",
    "Display name mapping" : "Vis navne tilknytning",
    "Gender mapping" : "Køn tilknytning",
    "Email mapping" : "Mail tilknytning",
    "Phone mapping" : "Telefon tilknytning",
    "Language mapping" : "Sprog tilknytning",
    "Role/Title mapping" : "Rolle/titel tilknytning",
    "Street mapping" : "Gade tilknytning",
    "Postal code mapping" : "Postnummer tilknytning",
    "Locality mapping" : "Lokalitet tilknytning",
    "Region mapping" : "Region tilknytning",
    "Country mapping" : "Lande tilknytning",
    "Organisation mapping" : "Organisation tilknytning",
    "Website mapping" : "Hjemmeside tilknytning",
    "Avatar mapping" : "Avatar tilknytning",
    "Biography mapping" : "Biografi tilknytning",
    "X (formerly Twitter) mapping" : "X (tidligere Twitter) tilknytning",
    "Fediverse/Nickname mapping" : "Fediverse/kaldenavn tilknytning",
    "Headline mapping" : "Overskrift tilknytning",
    "Authentication and Access Control Settings" : "Indstillinger for godkendelse og adgangskontrol",
    "Use unique user ID" : "Brug unikt Bruger ID",
    "By default every user will get a unique user ID that is a hashed value of the provider and user ID. This can be turned off but uniqueness of users accross multiple user backends and providers is no longer preserved then." : "Som standard vil hver bruger få et unikt bruger ID, der er en hashed værdi af udbyderen og bruger ID. Dette kan deaktiveres, men unikheden af brugerne på tværs af flere bruger backends og udbydere vil så ikke længere være bevaret.",
    "Use provider identifier as prefix for IDs" : "Brug udbyderens id som præfiks for ID'er",
    "To keep IDs in plain text, but also preserve uniqueness of them across multiple providers, a prefix with the providers name is added." : "For at holde ID'er i almindelig tekst, men også bevare unikke af dem på tværs af flere udbydere, et præfiks med udbyderens navn tilføjes.",
    "Use group provisioning." : "Brug gruppeprovisionering",
    "Group whitelist regex" : "Gruppe hvidlistet regex",
    "Restrict login for users that are not in any whitelisted group" : "Begræns login for brugere, der ikke er i nogen hvidlistet gruppe",
    "Users that are not part of any whitelisted group are not created and can not login" : "Brugere, der ikke er en del af nogen hvidlistet gruppe bliver ikke oprettet og kan ikke logge på",
    "Check Bearer token on API and WebDAV requests" : "Tjek Bearer token på API og WebDAV anmodninger",
    "Auto provision user when accessing API and WebDAV with Bearer token" : "Automatisk provisionering af bruger når API og WebDAV tilgås med Bearer token",
    "This automatically provisions the user, when sending API and WebDAV requests with a Bearer token. Auto provisioning and Bearer token check have to be activated for this to work." : "Dette provisionerer automatisk brugeren, når der sendes API og WebDAV anmodninger med en Bearer token. Auto provisionering og Bearer token kontrol skal aktiveres for at dette virker.",
    "Send ID token hint on logout" : "Send ID token hint om log af",
    "Should the ID token be included as the id_token_hint GET parameter in the OpenID logout URL? Users are redirected to this URL after logging out of Nextcloud. Enabling this setting exposes the OIDC ID token to the user agent, which may not be necessary depending on the OIDC provider." : "Skal ID token inkluderes som id_token_hint GET-parameteren i OpenID logud URL? Brugere omdirigeres til denne URL når de logger ud. Aktivering af denne indstilling eksponerer OIDC ID token til bruger-agenten, som måske ikke er nødvendig afhængigt af OIDC udbyder.",
    "Only groups matching the whitelist regex will be created, updated and deleted by the group claim. For example: {regex} allows all groups which ID starts with {substr}" : "Kun grupper der matcher hvidlistningens regex vil blive oprettet, opdateret og slettet af gruppe krav. For eksempel: {regex} tillader alle grupper hvis ID starter med {substr}",
    "This will create and update the users groups depending on the groups claim in the ID token. The Format of the groups claim value should be {sample1}, {sample2} or {sample3}" : "Dette vil oprette og opdatere brugernes grupper afhængigt af gruppernes krav i ID token. Formatet for gruppernes værdi skal være {sample1}, {sample2} eller {sample3}",
    "Back to %s" : "Tilbage til %s",
    "Domain" : "Domæne",
    "your.domain" : "dit.domæne"
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}