{ "translations": {
    "Login with %1s" : "Logáil isteach le %1s",
    "Error" : "Earráid",
    "Access forbidden" : "Rochtain toirmiscthe",
    "ID4Me is disabled" : "Tá ID4Me díchumasaithe",
    "Invalid OpenID domain" : "Fearann ​​​​OpenID neamhbhailí",
    "Invalid authority issuer" : "Eisitheoir údaráis neamhbhailí",
    "Multiple authority found" : "Fuarthas údarás iolrach",
    "The received state does not match the expected value." : "Ní mheaitseálann an staid faighte an luach ionchais.",
    "Authority not found" : "Údarás gan aimsiú",
    "Failed to decrypt the ID4ME provider client secret" : "Theip ar rún an chliaint soláthraí ID4ME a dhíchriptiú",
    "The received token is expired." : "Tá an comhartha faighte imithe in éag.",
    "The audience does not match ours" : "Ní hionann an lucht féachana agus ár lucht féachana",
    "The authorized party does not match ours" : "Ní mheaitseálann an páirtí údaraithe linne",
    "No authorized party" : "Gan páirtí údaraithe",
    "The nonce does not match" : "Ní hionann an nonce",
    "You must access Nextcloud with HTTPS to use OpenID Connect." : "Ní mór duit Nextcloud a rochtain le HTTPS chun OpenID Connect a úsáid.",
    "There is no such OpenID Connect provider." : "Níl a leithéid de sholáthraí OpenID Connect ann.",
    "Could not reach the OpenID Connect provider." : "Níorbh fhéidir an soláthraí OpenID Connect a bhaint amach.",
    "The identity provider failed to authenticate the user." : "Theip ar an soláthraí aitheantais an t-úsáideoir a fhíordheimhniú.",
    "Failed to decrypt the OIDC provider client secret" : "Theip ar rún an chliaint soláthraí OIDC a dhíchriptiú",
    "Failed to contact the OIDC provider token endpoint" : "Theip ar theagmháil a dhéanamh le críochphointe comharthaí an tsoláthraí OIDC",
    "The issuer does not match the one from the discovery endpoint" : "Ní mheaitseálann an t-eisitheoir leis an gceann ón gcríochphointe fionnachtana",
    "Failed to provision the user" : "Theip ar an úsáideoir a sholáthar",
    "You do not have permission to log in to this instance. If you think this is an error, please contact an administrator." : "Níl cead agat logáil isteach sa chás seo. Má cheapann tú gur earráid é seo, déan teagmháil le riarthóir.",
    "User conflict" : "Coimhlint úsáideora",
    "OpenID Connect" : "OpenID Connect",
    "OpenID Connect user backend" : "Inneall úsáideora OpenID Connect",
    "Use an OpenID Connect backend to login to your Nextcloud" : "Úsáid inneall OpenID Connect chun logáil isteach ar do Nextcloud",
    "Allows flexible configuration of an OIDC server as Nextcloud login user backend." : "Ligeann sé seo cumraíocht sholúbtha ar fhreastalaí OIDC mar inneall logáil isteach úsáideora Nextcloud.",
    "Are you sure you want to delete the provider \"{providerName}\"?" : "An bhfuil tú cinnte gur mian leat an soláthraí \"{providerName}\" a scriosadh?",
    "Could not save ID4me state: {msg}" : "Níorbh fhéidir staid ID4me a shábháil: {msg}",
    "Could not save storeLoginToken state: {msg}" : "Níorbh fhéidir staid storeLoginToken a shábháil: {msg}",
    "Could not update the provider:" : "Níorbh fhéidir an soláthraí a nuashonrú:",
    "Could not remove provider: {msg}" : "Níorbh fhéidir an soláthraí a bhaint: {msg}",
    "Could not register provider:" : "Níorbh fhéidir an soláthraí a chlárú:",
    "Allows users to authenticate via OpenID Connect providers." : "Ligeann sé d'úsáideoirí fíordheimhniú a dhéanamh trí sholáthraithe OpenID Connect.",
    "Enable ID4me" : "Cumasaigh ID4me",
    "Store login tokens" : "Stóráil comharthaí logáil isteach",
    "\"Store login tokens\" is needed if you are using other apps that want to use user_oidc's token exchange or simply get the login token" : "Tá \"Stóráil comharthaí logála isteach\" ag teastáil má tá tú ag úsáid aipeanna eile ar mian leo malartú comharthaí user_oidc a úsáid nó an comhartha logála isteach a fháil.",
    "Registered Providers" : "Soláthraithe Cláraithe",
    "Register new provider" : "Cláraigh soláthraí nua",
    "Register a new provider" : "Cláraigh soláthraí nua",
    "Configure your provider to redirect back to {url}" : "Cumraigh do sholáthraí chun atreorú ar ais chuige {url}",
    "No providers registered." : "Níl aon soláthraí cláraithe.",
    "Client ID" : "Aitheantas Cliant",
    "Discovery endpoint" : "Críochphointe fionnachtana",
    "Backchannel Logout URL" : "URL logáil Amach Cainéal droma",
    "Redirect URI (to be authorized in the provider client configuration)" : "Atreoraigh URI (le údarú i gcumraíocht cliant an tsoláthraí)",
    "Update" : "Nuashonrú",
    "Remove" : "Bain",
    "Update provider settings" : "Nuashonraigh socruithe soláthraí",
    "Update provider" : "Nuashonraigh soláthraí",
    "Confirm deletion" : "Deimhnigh scriosadh",
    "Cancel" : "Cealaigh",
    "Delete" : "Scrios",
    "Submit" : "Cuir isteach",
    "Client configuration" : "Cumraíocht an chliaint",
    "Identifier (max 128 characters)" : "Aitheantóir (128 carachtar ar a mhéad)",
    "Display name to identify the provider" : "Taispeáin an t-ainm chun an soláthraí a shainaithint",
    "Client secret" : "Rún an chliaint",
    "Leave empty to keep existing" : "Fág folamh a choinneáil ann cheana féin",
    "Warning, if the protocol of the URLs in the discovery content is HTTP, the ID token will be delivered through an insecure connection." : "Rabhadh, más HTTP prótacal na URLanna san ábhar fionnachtana, déanfar an comhartha aitheantais a sheachadadh trí nasc neamhchinnte.",
    "Custom end session endpoint" : "Críochphointe seisiún deiridh saincheaptha",
    "Post logout URI" : "URI logála amach poist",
    "Scope" : "Raon feidhme",
    "Extra claims" : "Éilimh bhreise",
    "Attribute mapping" : "Mapáil tréithe",
    "Enable nested and fallback claim mappings (like \"{example}\")" : "Cumasaigh mapálacha éileamh neadaithe agus cúl-ais (cosúil le \"{example}\")",
    "User ID mapping" : "Léarscáiliú aitheantais úsáideora",
    "Quota mapping" : "Mapáil cuóta",
    "Groups mapping" : "Mapáil grúpaí",
    "Extra attributes mapping" : "Mapáil tréithe breise",
    "Display name mapping" : "Taispeáin mapáil ainmneacha",
    "Birth date mapping" : "Mapáil dáta breithe",
    "Pronouns mapping" : "Mapáil forainmneacha",
    "Gender mapping" : "Mapáil inscne",
    "Email mapping" : "Mapáil ríomhphoist",
    "Phone mapping" : "Léarscáiliú fón",
    "Language mapping" : "Mapáil teanga",
    "Locale mapping" : "Mapáil logánta",
    "Role/Title mapping" : "Mapáil Róil/Teidil",
    "Street mapping" : "Léarscáiliú sráide",
    "Postal code mapping" : "Léarscáil cód poist",
    "Locality mapping" : "Léarscáiliú ceantair",
    "Region mapping" : "Léarscáiliú réigiúin",
    "Country mapping" : "Mapáil tíre",
    "Organisation mapping" : "Mapáil eagraíochta",
    "Website mapping" : "Léarscáiliú láithreán gréasáin",
    "Avatar mapping" : "Léarscáiliú avatar",
    "Biography mapping" : "Mapáil beathaisnéis",
    "X (formerly Twitter) mapping" : "Mapáil X (Twitter roimhe seo).",
    "Fediverse/Nickname mapping" : "Mapáil Fediverse/Leasainmneacha",
    "Headline mapping" : "Mapáil ceannlíne",
    "Authentication and Access Control Settings" : "Fíordheimhniú agus Socruithe Rialaithe Rochtana",
    "Use unique user ID" : "Úsáid ID úsáideora uathúil",
    "By default every user will get a unique user ID that is a hashed value of the provider and user ID. This can be turned off but uniqueness of users accross multiple user backends and providers is no longer preserved then." : "De réir réamhshocraithe gheobhaidh gach úsáideoir ID úsáideora uathúil ar luach haisithe an tsoláthraí agus ID an úsáideora é. Is féidir é seo a mhúchadh ach ní choinnítear uathúlacht na n-úsáideoirí trasna na n-innill úsáideoirí iolracha agus soláthraithe a thuilleadh ag an am sin.",
    "Use provider identifier as prefix for IDs" : "Úsáid aitheantóir soláthraí mar réimír le haghaidh aitheantais",
    "To keep IDs in plain text, but also preserve uniqueness of them across multiple providers, a prefix with the providers name is added." : "Chun aitheantais a choinneáil i ngnáth-théacs, ach freisin a n-uathúlacht a chaomhnú thar ilsholáthraí, cuirtear réimír ar a bhfuil ainm an tsoláthraí leis.",
    "Use group provisioning." : "Bain úsáid as soláthar grúpa.",
    "Group whitelist regex" : "Grúpa bán liosta regex",
    "Restrict login for users that are not in any whitelisted group" : "Cuir srian le logáil isteach d'úsáideoirí nach bhfuil in aon ghrúpa ar an liosta bán",
    "Users that are not part of any whitelisted group are not created and can not login" : "Ní chruthaítear úsáideoirí nach bhfuil ina gcuid d'aon ghrúpa ar an liosta bán agus ní féidir leo logáil isteach",
    "Check Bearer token on API and WebDAV requests" : "Seiceáil an comhartha Iompróra ar iarratais API agus WebDAV",
    "Do you want to allow API calls and WebDAV requests that are authenticated with an OIDC ID token or access token?" : "Ar mhaith leat glaonna API agus iarratais WebDAV a cheadú atá fíordheimhnithe le comhartha aitheantais OIDC nó comhartha rochtana?",
    "Auto provision user when accessing API and WebDAV with Bearer token" : "Úsáideoir soláthair uathoibríoch agus é ag rochtain API agus WebDAV le hiompróir chomhartha",
    "This automatically provisions the user, when sending API and WebDAV requests with a Bearer token. Auto provisioning and Bearer token check have to be activated for this to work." : "Soláthraíonn sé seo go huathoibríoch don úsáideoir, agus iarratais API agus WebDAV á sheoladh le comhartha Iompróra. Ní mór soláthar carranna agus seiceáil chomharthaí Iompróra a ghníomhachtú le go n-oibreoidh sé seo.",
    "Send ID token hint on logout" : "Seol leid comhartha aitheantais ar logáil amach",
    "Should the ID token be included as the id_token_hint GET parameter in the OpenID logout URL? Users are redirected to this URL after logging out of Nextcloud. Enabling this setting exposes the OIDC ID token to the user agent, which may not be necessary depending on the OIDC provider." : "Ar cheart an comhartha aitheantais a chur san áireamh mar pharaiméadar id_token_hint GET sa URL logála amach OpenID? Déantar úsáideoirí a atreorú chuig an URL seo tar éis logáil amach as Nextcloud. Má dhéantar an socrú seo a chumasú, nochtfar an comhartha aitheantais OIDC don ghníomhaire úsáideora, rud nach mbeidh riachtanach ag brath ar sholáthraí an OIDC.",
    "Only groups matching the whitelist regex will be created, updated and deleted by the group claim. For example: {regex} allows all groups which ID starts with {substr}" : "Ní chruthófar, nuashonrófar agus scriosfaidh an t-éileamh grúpa ach grúpaí a mheaitseálann an liosta bán regex. Mar shampla, ceadaíonn: {regex} gach grúpa a thosaíonn le{substr}",
    "This will create and update the users groups depending on the groups claim in the ID token. The Format of the groups claim value should be {sample1}, {sample2} or {sample3}" : "Cruthóidh agus nuashonróidh sé seo na grúpaí úsáideoirí ag brath ar éileamh na ngrúpaí sa chomhartha aitheantais. Ba cheart go mbeadh {sample1}, {sample2} nó {sample3} i bhFormáid luach éilimh na ngrúpaí",
    "Back to %s" : "Ar ais go dtí %s",
    "Domain" : "Fearann",
    "your.domain" : "do.fearann"
},"pluralForm" :"nplurals=5; plural=(n==1 ? 0 : n==2 ? 1 : n<7 ? 2 : n<11 ? 3 : 4);"
}