{ "translations": {
    "Login with %1s" : "Ingia na %1s",
    "Error" : "Hitilafu",
    "Access forbidden" : "Ufukiaji umezuiliwa",
    "ID4Me is disabled" : "ID4Me imezimwa",
    "Invalid OpenID domain" : "Kikoa batili cha OpenID\n ",
    "Invalid authority issuer" : "Mtoaji mamlaka batili",
    "Multiple authority found" : "Mamlaka nyingi zimepatikana",
    "The received state does not match the expected value." : "Hali iliyopokelewa haifanani na thamani inayotarajiwa.",
    "Authority not found" : "Mamlaka haikupatikana",
    "Failed to decrypt the ID4ME provider client secret" : "Imeshindwa kufungua siri ya mtoa huduma wa ID4ME",
    "The received token is expired." : "Token iliyopokelewa imekwisha muda wake.",
    "The audience does not match ours" : "Hadhira haifanani na yetu",
    "The authorized party does not match ours" : "Chama kilichoidhinishwa hakilingani na chetu",
    "No authorized party" : "Hakuna chama kilichoidhinishwa",
    "The nonce does not match" : "Nambari ya kipekee hailingani",
    "You must access Nextcloud with HTTPS to use OpenID Connect." : "Lazima ufikie Nextcloud kwa HTTPS ili kutumia OpenID Connect.",
    "There is no such OpenID Connect provider." : "Hakuna mtoa huduma wa OpenID Connect kama huyo.",
    "Could not reach the OpenID Connect provider." : "Haikuweza kufikia mtoa huduma wa OpenID Connect.",
    "The identity provider failed to authenticate the user." : "Mtoa huduma wa kitambulisho alishindwa kumthibitisha mtumiaji.",
    "Failed to decrypt the OIDC provider client secret" : "Imeshindwa kufungua siri ya mteja wa mtoa huduma wa OIDC",
    "Failed to contact the OIDC provider token endpoint" : "Imeshindwa kuwasiliana na sehemu ya mwisho ya tokeni ya mtoa huduma wa OIDC",
    "The issuer does not match the one from the discovery endpoint" : "Mtoaji hailingani na yule kutoka kwenye mwisho wa ugunduzi",
    "Failed to provision the user" : "Imeshindwa kumtayarisha mtumiaji",
    "You do not have permission to log in to this instance. If you think this is an error, please contact an administrator." : "Huna ruhusa ya kuingia kwa mfano huu. Ikiwa unadhani hii ni hitilafu, tafadhali wasiliana na msimamizi.",
    "User conflict" : "Mzozo wa mtumiaji",
    "OpenID Connect" : "Unganisho wa OpenID",
    "OpenID Connect user backend" : "Seva ya nyuma ya mtumiaji wa OpenID Connect",
    "Use an OpenID Connect backend to login to your Nextcloud" : "Tumia backend ya OpenID Connect kuingia kwenye Nextcloud yako",
    "Allows flexible configuration of an OIDC server as Nextcloud login user backend." : "Inaruhusu usanidi unaobadilika wa seva ya OIDC kama msingi wa kuingia kwa mtumiaji wa Nextcloud.",
    "Are you sure you want to delete the provider \"{providerName}\"?" : "Je, una uhakika unataka kufuta mtoa huduma \"{providerName}\"?",
    "Could not save ID4me state: {msg}" : " Haikuweza kuhifadhi hali ya ID4me: {msg}",
    "Could not save storeLoginToken state: {msg}" : "Haikuweza kuhifadhi hali ya storeLoginToken: {msg}",
    "Could not update the provider:" : "Haikuweza kusasisha mtoa huduma:",
    "Could not remove provider: {msg}" : "Haikuweza kuondoa mtoa huduma: {msg}",
    "Could not register provider:" : "Haikuweza kusajili mtoa huduma:",
    "Allows users to authenticate via OpenID Connect providers." : "Inaruhusu watumiaji kuthibitisha kupitia watoa huduma wa OpenID Connect.",
    "Enable ID4me" : "Wezesha ID4me",
    "Store login tokens" : "Hifadhi tokeni za kuingia",
    "Registered Providers" : "Watoa Huduma Waliosajiliwa",
    "Register new provider" : "Sajili mtoa huduma mpya",
    "Register a new provider" : "Sajili mtoa huduma mpya",
    "Configure your provider to redirect back to {url}" : "Sanidi mtoa huduma wako ili kuelekeza tena kwa {url}",
    "No providers registered." : "Hakuna watoa huduma waliosajiliwa.",
    "Client ID" : "Kitambulisho cha mteja",
    "Discovery endpoint" : "Kituo cha ugunduzi",
    "Backchannel Logout URL" : "URL ya Kuondoka kwa Njia ya Nyuma",
    "Redirect URI (to be authorized in the provider client configuration)" : "Elekeza upya URI (ili kuidhinishwa katika usanidi wa mteja wa mtoaji)",
    "Update" : "Sasisha",
    "Remove" : "Ondoa",
    "Update provider settings" : "Sasisha mipangilio ya mtoa huduma",
    "Update provider" : "Sasisha mtoa huduma",
    "Confirm deletion" : "Thibitisha ufutaji",
    "Cancel" : "Sitisha",
    "Delete" : "Futa",
    "Submit" : "Wasilisha",
    "Client configuration" : "Usanidi wa mteja",
    "Identifier (max 128 characters)" : "Kitambulisho (herufi zisizozidi 128)",
    "Display name to identify the provider" : "Onyesha jina ili kutambua mtoa huduma",
    "Client secret" : "Siri ya mteja",
    "Leave empty to keep existing" : "Acha tupu ili kuweka iliyopo",
    "Warning, if the protocol of the URLs in the discovery content is HTTP, the ID token will be delivered through an insecure connection." : "Onyo, ikiwa itifaki ya URL katika maudhui ya ugunduzi ni HTTP, tokeni ya ID itatolewa kupitia muunganisho usio salama.",
    "Custom end session endpoint" : "Mwisho wa kipindi maalum",
    "Post logout URI" : "URI ya baada ya kutoka",
    "Scope" : "Wigo",
    "Extra claims" : "Madai ya ziada",
    "Attribute mapping" : "Ramani ya sifa",
    "Enable nested and fallback claim mappings (like \"{example}\")" : "Wezesha ramani za madai zilizopachikwa na za akiba (like \"{example}\")",
    "User ID mapping" : "Ramani ya Kitambulisho cha Mtumiaji",
    "Quota mapping" : "Ramani ya mgao",
    "Groups mapping" : "Ramani ya vikundi",
    "Extra attributes mapping" : "Ramani ya sifa za ziada",
    "Display name mapping" : "Ramani ya jina la kuonyesha",
    "Birth date mapping" : "Kupanga tarehe ya kuzaliwa",
    "Pronouns mapping" : "Viwakilishi ramani",
    "Gender mapping" : "Ramani ya jinsia",
    "Email mapping" : "Ramani ya barua pepe",
    "Phone mapping" : "Ramani ya simu",
    "Language mapping" : "Ramani ya lugha",
    "Role/Title mapping" : "Ramani ya Wajibu/nafasi",
    "Street mapping" : "Ramani ya mtaa",
    "Postal code mapping" : "Ramani ya msimbo wa posta",
    "Locality mapping" : "Ramani ya eneo",
    "Region mapping" : "Ramani ya mkoa",
    "Country mapping" : "Ramani ya nchi",
    "Organisation mapping" : "Ramani ya shirika",
    "Website mapping" : "Ramani ya tovuti",
    "Avatar mapping" : "Ramani ya Avatar ",
    "Biography mapping" : "Ramani ya wasifu",
    "X (formerly Twitter) mapping" : "Ramani ya X (zamani twitter)",
    "Fediverse/Nickname mapping" : "Ramani ya Fediverse/Jina la Utani",
    "Headline mapping" : "Ramani ya vichwa vya habari",
    "Authentication and Access Control Settings" : "Mipangilio ya Uthibitishaji na Udhibiti wa Ufikiaji",
    "Use unique user ID" : "Tumia kitambulisho cha kipekee cha mtumiaji",
    "By default every user will get a unique user ID that is a hashed value of the provider and user ID. This can be turned off but uniqueness of users accross multiple user backends and providers is no longer preserved then." : "Kwa chaguo-msingi kila mtumiaji atapata kitambulisho cha kipekee cha mtumiaji ambacho ni thamani ya haraka ya kitambulisho cha mtoa huduma na mtumiaji. Hii inaweza kuzimwa lakini upekee wa watumiaji katika sehemu nyingi za nyuma za watumiaji na watoa huduma hauhifadhiwi tena wakati huo.",
    "Use provider identifier as prefix for IDs" : "Tumia kitambulisho cha mtoa huduma kama kiambishi awali kwa vitambulisho",
    "To keep IDs in plain text, but also preserve uniqueness of them across multiple providers, a prefix with the providers name is added." : "Ili kuweka vitambulisho katika maandishi wazi, lakini pia kuhifadhi kipekee kati ya watoa huduma wengi, kiambishi awali chenye jina la watoa huduma huongezwa.",
    "Use group provisioning." : "Tumia utoaji wa kikundi.",
    "Group whitelist regex" : "Kikundi cha regex ya orodha nyeupe",
    "Restrict login for users that are not in any whitelisted group" : "Zuia kuingia kwa watumiaji ambao hawako katika kikundi chochote kilichoorodheshwa kwenye orodha nyeupe",
    "Users that are not part of any whitelisted group are not created and can not login" : "Watumiaji ambao si sehemu ya kundi lolote lililoruhusiwa hawatengenezwi na hawawezi kuingia",
    "Check Bearer token on API and WebDAV requests" : "Kagua token ya Mtoa kwenye maombi ya API na WebDAV",
    "Do you want to allow API calls and WebDAV requests that are authenticated with an OIDC ID token or access token?" : "Je, unataka kuruhusu miito ya API na maombi ya WebDAV ambayo yanathibitishwa kwa kutumia tokeni ya kitambulisho cha OIDC au tokeni ya ufikiaji?",
    "Auto provision user when accessing API and WebDAV with Bearer token" : "Kujipatia mtumiaji kiotomatiki anapofikia API na WebDAV kwa tokeni ya Bearer",
    "This automatically provisions the user, when sending API and WebDAV requests with a Bearer token. Auto provisioning and Bearer token check have to be activated for this to work." : "Hii humpa mtumiaji kiotomatiki, anapotuma maombi ya API na WebDAV na tokeni ya Bearer. Utoaji kiotomatiki na ukaguzi wa tokeni ya Bearer lazima uanzishwe ili hii ifanye kazi.",
    "Send ID token hint on logout" : "Tuma kidokezo cha kitambulisho cha ID wakati wa kutoka",
    "Should the ID token be included as the id_token_hint GET parameter in the OpenID logout URL? Users are redirected to this URL after logging out of Nextcloud. Enabling this setting exposes the OIDC ID token to the user agent, which may not be necessary depending on the OIDC provider." : "Je, tokeni ya kitambulisho inapaswa kujumuishwa kama kigezo cha id_token_hint GET katika URL ya kuondoka kwa OpenID? Watumiaji huelekezwa kwenye URL hii baada ya kuondoka kwenye Nextcloud. Kuwasha mpangilio huu hufichua tokeni ya Kitambulisho cha OIDC kwa wakala wa mtumiaji, ambayo huenda isiwe muhimu kulingana na mtoa huduma wa OIDC.",
    "Only groups matching the whitelist regex will be created, updated and deleted by the group claim. For example: {regex} allows all groups which ID starts with {substr}" : "Vikundi vinavyolingana na orodha iliyoidhinishwa pekee ndivyo vitaundwa, kusasishwa na kufutwa na dai la kikundi. Kwa mfano: {regex} inaruhusu vikundi vyote ambavyo kitambulisho kinaanza nacho {substr}",
    "This will create and update the users groups depending on the groups claim in the ID token. The Format of the groups claim value should be {sample1}, {sample2} or {sample3}" : "Hii itaunda na kusasisha vikundi vya watumiaji kulingana na dai la vikundi katika tokeni ya ID. Muundo wa thamani ya dai la vikundi unapaswa kuwa{sample1}, {sample2} au {sample3}",
    "Back to %s" : "Rudi kwenye %s",
    "Domain" : "Domain",
    "your.domain" : "kikoa.chako"
},"pluralForm" :"nplurals=2; plural=(n != 1);"
}