{ "translations": {
    "Login with %1s" : "Увійдіть за допомогою %1s",
    "Error" : "Помилка",
    "Access forbidden" : "Доступ заборонено",
    "ID4Me is disabled" : "ID4Me вимкнено",
    "Invalid OpenID domain" : "Неправильний домен OpenID",
    "Invalid authority issuer" : "Недійсний емітент повноважень",
    "Multiple authority found" : "Знайдено кілька авторитетів",
    "The received state does not match the expected value." : "Отриманий стан не відповідає очікуваному значенню.",
    "Authority not found" : "Орган не знайдено",
    "Failed to decrypt the ID4ME provider client secret" : "Не вдалося розшифрувати секрет клієнта провайдера ID4ME",
    "The received token is expired." : "Термін дії отриманого токена закінчився.",
    "The audience does not match ours" : "Аудиторія не збігається з нашою",
    "The authorized party does not match ours" : "Уповноважена сторона не збігається з нашою",
    "No authorized party" : "Немає уповноваженої сторони",
    "The nonce does not match" : "Не збігається нонсенс",
    "You must access Nextcloud with HTTPS to use OpenID Connect." : "Щоб використовувати OpenID Connect, ви повинні отримати доступ до Nextcloud через HTTPS.",
    "There is no such OpenID Connect provider." : "Такого провайдера OpenID Connect не існує.",
    "Could not reach the OpenID Connect provider." : "Не вдалося зв'язатися з провайдером OpenID Connect.",
    "The identity provider failed to authenticate the user." : "Постачальнику ідентифікаторів не вдалося автентифікувати користувача.",
    "Failed to decrypt the OIDC provider client secret" : "Не вдалося розшифрувати секрет клієнта постачальника OIDC",
    "Failed to contact the OIDC provider token endpoint" : "Не вдалося зв'язатися з кінцевою точкою токена постачальника OIDC",
    "The issuer does not match the one from the discovery endpoint" : "Емітент не збігається з емітентом з кінцевої точки виявлення",
    "Failed to provision the user" : "Не вдалося надати користувачеві",
    "You do not have permission to log in to this instance. If you think this is an error, please contact an administrator." : "Ви не маєте дозволу для входу в цей екземпляр. Якщо ви вважаєте, що це помилка, зверніться до адміністратора.",
    "User conflict" : "Конфлікт користувачів",
    "OpenID Connect" : "OpenID Connect",
    "OpenID Connect user backend" : "OpenID Підключіть бекенд користувача",
    "Use an OpenID Connect backend to login to your Nextcloud" : "Використовуйте бекенд OpenID Connect для входу до Nextcloud",
    "Allows flexible configuration of an OIDC server as Nextcloud login user backend." : "Дозволяє гнучко конфігурувати сервер OIDC як бекенд користувача для входу в Nextcloud.",
    "Are you sure you want to delete the provider \"{providerName}\"?" : "Ви впевнені, що хочете видалити провайдера \"{providerName}\"?",
    "Could not save ID4me state: {msg}" : "Не вдалося зберегти стан ID4me: {msg}",
    "Could not save storeLoginToken state: {msg}" : "Не вдалося зберегти стан storeLoginToken: {msg}",
    "Could not update the provider:" : "Не вдалося оновити провайдера:",
    "Could not remove provider: {msg}" : "Не вдалося видалити провайдера: {msg}",
    "Could not register provider:" : "Не вдалося зареєструвати провайдера:",
    "Allows users to authenticate via OpenID Connect providers." : "Дозволяє користувачам автентифікуватися через провайдерів OpenID Connect.",
    "Enable ID4me" : "Увімкнути ID4me",
    "Store login tokens" : "Великі токени для входу",
    "Registered Providers" : "Зареєстровані провайдери",
    "Register new provider" : "Зареєструвати нового провайдера",
    "Register a new provider" : "Зареєструвати нового постачальника",
    "Configure your provider to redirect back to {url}" : "Налаштуйте перенаправлення вашого провайдера на {url}",
    "No providers registered." : "Провайдерів не зареєстровано.",
    "Client ID" : "Ідентифікатор клієнта",
    "Discovery endpoint" : "Кінцева точка виявлення",
    "Backchannel Logout URL" : "URL-адреса виходу з каналу зворотного зв'язку",
    "Redirect URI (to be authorized in the provider client configuration)" : "Перенаправлення URI (має бути авторизовано в конфігурації клієнта провайдера)",
    "Update" : "Оновлювати",
    "Remove" : "Вилучити",
    "Update provider settings" : "Оновлення налаштувань провайдера",
    "Update provider" : "Постачальник оновлень",
    "Confirm deletion" : "Підтвердіть вилучення",
    "Cancel" : "Скасувати",
    "Delete" : "Вилучати",
    "Submit" : "Відправити",
    "Client configuration" : "Конфігурація клієнта",
    "Identifier (max 128 characters)" : "Ідентифікатор (макс. 128 символів)",
    "Display name to identify the provider" : "Відображати ім'я для ідентифікації провайдера",
    "Client secret" : "Ключ клієнта",
    "Leave empty to keep existing" : "Залиште порожнім, щоб продовжити існування",
    "Warning, if the protocol of the URLs in the discovery content is HTTP, the ID token will be delivered through an insecure connection." : "Попередження: якщо протокол URL-адрес у вмісті виявлення - HTTP, то маркер ідентифікатора буде доставлено через незахищене з'єднання.",
    "Custom end session endpoint" : "Користувацька кінцева точка завершення сеансу",
    "Scope" : "Область",
    "Extra claims" : "Додаткові вимоги",
    "Attribute mapping" : "Мапування атрибутів",
    "Enable nested and fallback claim mappings (like \"{example}\")" : "Увімкніть вкладені та резервні відображення заяв (наприклад, \"{example}\")",
    "User ID mapping" : "Відображення ідентифікатора користувача",
    "Quota mapping" : "Картування квот",
    "Groups mapping" : "Мапування груп",
    "Extra attributes mapping" : "Відображення додаткових атрибутів",
    "Display name mapping" : "Відображення імен дисплеїв",
    "Gender mapping" : "Гендерне картографування",
    "Email mapping" : "Мапування електронної пошти",
    "Phone mapping" : "Телефонна мапа",
    "Language mapping" : "Мовне мапування",
    "Role/Title mapping" : "Зіставлення ролей/посадових обов'язків",
    "Street mapping" : "Мапування вулиць",
    "Postal code mapping" : "Відображення поштових індексів",
    "Locality mapping" : "Картографування місцевості",
    "Region mapping" : "Мапування регіонів",
    "Country mapping" : "Карта країни",
    "Organisation mapping" : "Картування організації",
    "Website mapping" : "Мапування веб-сайтів",
    "Avatar mapping" : "Мапування аватарів",
    "Biography mapping" : "Біографічне картографування",
    "X (formerly Twitter) mapping" : "X (раніше Twitter) мапування",
    "Fediverse/Nickname mapping" : "Співставлення федерацій / нікнеймів",
    "Headline mapping" : "Мапування заголовків",
    "Authentication and Access Control Settings" : "Налаштування автентифікації та контролю доступу",
    "Use unique user ID" : "Використовуйте унікальний ідентифікатор користувача",
    "By default every user will get a unique user ID that is a hashed value of the provider and user ID. This can be turned off but uniqueness of users accross multiple user backends and providers is no longer preserved then." : "За замовчуванням кожен користувач отримує унікальний ідентифікатор користувача, який є хешованим значенням провайдера та ідентифікатора користувача. Цю функцію можна вимкнути, але в такому разі унікальність користувачів у різних бекендах та провайдерах більше не зберігатиметься.",
    "Use provider identifier as prefix for IDs" : "Використовуйте ідентифікатор постачальника як префікс для ідентифікаторів",
    "To keep IDs in plain text, but also preserve uniqueness of them across multiple providers, a prefix with the providers name is added." : "Щоб зберегти ідентифікатори у вигляді простого тексту, а також зберегти їх унікальність для різних постачальників, додається префікс з назвою постачальника.",
    "Use group provisioning." : "Використовуйте групові налаштування.",
    "Group whitelist regex" : "Regex для групового білого списку",
    "Restrict login for users that are not in any whitelisted group" : "Обмежити вхід для користувачів, які не входять до жодної з груп білого списку",
    "Users that are not part of any whitelisted group are not created and can not login" : "Користувачі, які не входять до жодної з груп білого списку, не створюються і не можуть увійти",
    "Check Bearer token on API and WebDAV requests" : "Перевіряйте токен пред'явника в API та WebDAV запитах",
    "Do you want to allow API calls and WebDAV requests that are authenticated with an OIDC ID token or access token?" : "Ви хочете дозволити виклики API та запити WebDAV, які автентифіковані за допомогою токена OIDC ID або токена доступу?",
    "Auto provision user when accessing API and WebDAV with Bearer token" : "Автоматичне надання користувача при доступі до API та WebDAV з токеном пред'явника",
    "This automatically provisions the user, when sending API and WebDAV requests with a Bearer token. Auto provisioning and Bearer token check have to be activated for this to work." : "Це автоматично надає користувачеві доступ при надсиланні запитів API та WebDAV із токеном Bearer. Для того, щоб це працювало, необхідно активувати автоматичне надання доступу та перевірку токена Bearer.",
    "Send ID token hint on logout" : "Надсилати підказку ID-токену при виході з системи",
    "Should the ID token be included as the id_token_hint GET parameter in the OpenID logout URL? Users are redirected to this URL after logging out of Nextcloud. Enabling this setting exposes the OIDC ID token to the user agent, which may not be necessary depending on the OIDC provider." : "Чи слід включати ідентифікаційний токен як параметр GET id_token_hint в URL-адресу виходу з OpenID? Користувачі перенаправляються на цю URL-адресу після виходу з Nextcloud. Увімкнення цього параметра відкриває ідентифікаційний токен OIDC для агента користувача, що може бути не потрібним залежно від постачальника OIDC.",
    "Only groups matching the whitelist regex will be created, updated and deleted by the group claim. For example: {regex} allows all groups which ID starts with {substr}" : "Тільки групи, що відповідають регулярному виразу білого списку, будуть створюватися, оновлюватися та видалятися за допомогою заявки групи. Наприклад: {regex} дозволяє всі групи, ідентифікатор яких починається з {substr}",
    "This will create and update the users groups depending on the groups claim in the ID token. The Format of the groups claim value should be {sample1}, {sample2} or {sample3}" : "Це створить та оновить групи користувачів залежно від заявки груп у токені ID. Формат значення заявки груп повинен бути {sample1}, {sample2} або {sample3}",
    "Back to %s" : "Назад до %s",
    "Domain" : "Домен",
    "your.domain" : "ваш.домен"
},"pluralForm" :"nplurals=4; plural=(n % 1 == 0 && n % 10 == 1 && n % 100 != 11 ? 0 : n % 1 == 0 && n % 10 >= 2 && n % 10 <= 4 && (n % 100 < 12 || n % 100 > 14) ? 1 : n % 1 == 0 && (n % 10 ==0 || (n % 10 >=5 && n % 10 <=9) || (n % 100 >=11 && n % 100 <=14 )) ? 2: 3);"
}